brew "mas"
mas "AdGuard for Safari", id: 1440147259
mas "Bitwarden", id: 1352778147
mas "Flow - Focus & Pomodoro Timer", id: 1423210932
mas "Foodnoms - Nutrition Tracker", id: 1479461686
mas "Kagi for Safari", id: 1622835804
mas "ZSA Keymapp", id: 6472865291

brew "defaultbrowser"
brew "dockutil"
brew "git-lfs"

cask "balenaetcher"
cask "chromium"
cask "discord"
cask "font-3270-nerd-font"
cask "logseq"
cask "orion"
cask "podman-desktop"
cask "raycast"
cask "rio"
cask "steam"
cask "zed"
